
Режим = РежимДиалогаВыбораФайла.ВыборКаталога;
ДиалогОткрытия = Новый ДиалогВыбораФайла(Режим);
ДиалогОткрытия.Каталог = "";
ДиалогОткрытия.МножественныйВыбор = Ложь;
ДиалогОткрытия.Заголовок = "Выберите каталог";

Если ДиалогОткрытия.Выбрать() Тогда
   ПутьККаталогу = ДиалогОткрытия.Каталог;
КонецЕсли;

&НаКлиенте
Функция ПрочитатьТекстовыйФайл(ИмяФайла)

	ТекстовыйФайл = Новый ТекстовыйДокумент;
 
    ТекстовыйФайл.Прочитать(ИмяФайла,
        КодировкаТекста.UTF8
    );

	Возврат ТекстовыйФайл.ПолучитьТекст();

КонецФункции

&НаКлиенте
Процедура ЗаписатьТекстовыйФайл(ИмяФайла, Текст)

	ТекстовыйФайл = Новый ТекстовыйДокумент;

    ТекстовыйФайл.УстановитьТекст(Текст);

	//ТекстовыйФайл.ДобавитьСтроку("");

    ТекстовыйФайл.Записать(ИмяФайла,
        КодировкаТекста.UTF8
    );

КонецПроцедуры
