// отправить сообщение в MyChat
Процедура ОтправитьСообщениеMyChat(Отправитель, МассивПолучателей, ТекстСообщения) Экспорт

    Сервер = "192.168.2.18";
    Порт = 8080; //8080
    Ресурс = "/API/?data=";
    Ключ = "Og1_WM_8xQ8gS6julMfb";

    UINПолучателя = "0";

    СтруктураДанных = Новый Структура;
    СтруктураДанных.Вставить("cmd",       "0002");
    СтруктураДанных.Вставить("UserFrom",  Отправитель);
    СтруктураДанных.Вставить("UserTo",	  UINПолучателя);
    СтруктураДанных.Вставить("Msg",       ТекстСообщения);
    СтруктураДанных.Вставить("APIStype",  "mcrest");
    СтруктураДанных.Вставить("ServerKey", Ключ);

    Для Каждого UINПолучателя Из МассивПолучателей Цикл

        СтруктураДанных.UserTo = UINПолучателя;

        ЗаписьJSON = Новый ЗаписьJSON;
        ЗаписьJSON.УстановитьСтроку();
        ЗаписатьJSON(ЗаписьJSON, СтруктураДанных);
        СтрокаJSON = ЗаписьJSON.Закрыть();

        Попытка
            HTTP = Новый HTTPСоединение(Сервер,Порт,,,,3);
            HTTPЗапрос = Новый HTTPЗапрос(Ресурс);
            HTTPЗапрос.Заголовки.Вставить("Content-type", "application/x-www-form-urlencoded");
            HTTPЗапрос.УстановитьТелоИзСтроки(СтрокаJSON, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать);
            Результат  = HTTP.ОтправитьДляОбработки(HTTPЗапрос);
            Если Результат.КодСостояния <> 200 Тогда
                ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
                ЗаписьЖурналаРегистрации(НСтр("ru = 'Неудачная отправка сообщения!'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
            КонецЕсли;
        Исключение
            ТекстСообщения = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
            ЗаписьЖурналаРегистрации(НСтр("ru = 'Неудачная отправка сообщения!'"), УровеньЖурналаРегистрации.Ошибка,,, ТекстСообщения);
        КонецПопытки;

    КонецЦикла;
КонецПроцедуры
